"use strict";

//--------------------------------------------------------------------------------
// パッケージの読み込み
//--------------------------------------------------------------------------------
const gulp = require("gulp");
const connect = require('gulp-connect-php');
const browserSync = require("browser-sync");

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
const taskName = require("../configs/task-name.config");
const config = require("../configs/browser-sync.config");
const configPhp = require("../configs/browser-sync-php.config");
const configConnectPhp = require('../configs/connect-php.config');
const usePhp = false; // PHP使用する場合は true
//--------------------------------------------------------------------------------
// タスクの定義
//--------------------------------------------------------------------------------
const execute = () => {
  if(usePhp){
    //--------------------------------------------------------------------------------
    // PHP使用する場合
    //--------------------------------------------------------------------------------
    connect.server(configConnectPhp, function (){
      browserSync(configPhp);
    });
  } else {
    //--------------------------------------------------------------------------------
    // PHP使用しない場合
    //--------------------------------------------------------------------------------
    browserSync(config);
  }

};

//--------------------------------------------------------------------------------
// タスクの登録
//--------------------------------------------------------------------------------
gulp.task(taskName.browserSync, execute);

module.exports = execute;
