"use strict";

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
const dir = require("../configs/dir.config");

//--------------------------------------------------------------------------------
// 設定のエクスポート
//--------------------------------------------------------------------------------
module.exports = {
  entries: [
    {
      // 対象ファイル
      src: [//`${dir.src}${dir.lib}lazysizes.min.js`,
        //`${dir.src}${dir.lib}ls.unveilhooks.min.js`,
        //`${dir.src}${dir.lib}barba.min.js`,
        //`${dir.src}${dir.lib}anime.min.js`
          `${dir.src}${dir.lib}fitie.js`],
      // 出力先（build/releaseディレクトリは自動的に付与するので不要）
      dest: dir.js,
      // 出力するファイル名
      out: "lib.js"
    }
  ]
};
