"use strict";

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
const dir = require("../configs/dir.config");

//--------------------------------------------------------------------------------
// 設定のエクスポート
//--------------------------------------------------------------------------------
module.exports = {
  entries: [
    {
      // 対象ファイル
      src: [`${dir.src}${dir.js}**/*.js`],
      // 出力先（build/releaseディレクトリは自動的に付与するので不要）
      dest: dir.js,
      // gulp-uglifyの設定（詳細：https://github.com/mishoo/UglifyJS2#minify-options）
      uglifyConfig: {
        output: {
          comments: /^!/
        }
      }
    }
  ]
};
