'use strict';
//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
const dir = require("../configs/dir.config");

//--------------------------------------------------------------------------------
// 設定のエクスポート
//--------------------------------------------------------------------------------
module.exports = {
  entries: [
    {
      // 対象ファイル
      src: [`${dir.src}${dir.php}**/*.php`],
      // 出力先（build/releaseディレクトリは自動的に付与するので不要）
      dest: "",
      settings: {
        ext: '.php'
      }
    },
    {
      // 対象ファイル
      src: [`${dir.src}${dir.inc}**/*.php`],
      // 出力先（build/releaseディレクトリは自動的に付与するので不要）
      dest: dir.inc,
      settings: {
        ext: '.php'
      }
    }
  ]
};
